fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
/***************
* Xtase - fgalliat @ Sept2017
* Hardware Layer
****************/

#ifndef COMPUTER
  #include <Arduino.h>
#else 
  #include "computer.h"
#endif

#include "xts_arch.h"
extern GenericMCU mcu;

#include "xts_io.h"

#define BASIC_ASCII_FILE_EXT ".BAS"

// ***********************************
// TODO : move in GenericMCU impl.
char* SDentryName = NULL;

  // BEWARE : uses & modifies : SDentryName[]
  // ex. autocomplete_fileExt(filename, ".BAS") => SDentryName[] contains full file-name
  // assumes that ext is stricly 3 char long
  // + 1 for leading '/'
  char* autocomplete_fileExt(char* filename, const char* defFileExt) {
    if ( SDentryName == NULL ) {
      SDentryName = (char*)malloc(13+1);
    }
    int flen = strlen(filename);
    memset(SDentryName, 0x00, 8+1+3+1+1); // 13+1 char long
    SDentryName[0] = '/';
    int l = strlen( filename );
    char ch;
    bool foundAPoint = false;
    for(int i=0; i < l; i++) {
      ch = filename[i];
      if ( ch >= 'a' && ch <= 'z' ) {
        ch = ch - 'a' + 'A';
      } else if ( ch == '.' ) {
        foundAPoint = true;
      }
      SDentryName[1+i] = ch;
    }
    if ( !foundAPoint ) {
      strcat( SDentryName, defFileExt );
    }
    Serial.println( SDentryName );
    return (char*)SDentryName;
  }
// ***********************************

#include "host_xts.h"
#include "basic.h"
extern bool isGfxAutoBlitt();

extern int SCREEN_HEIGHT;
extern unsigned char tokenBuf[];

extern int OUTPUT_DEVICE;
extern int GFX_DEVICE;
extern int INPUT_DEVICE;

extern char codeLine[];
void cleanCodeLine() {
  memset(codeLine, 0x00, ASCII_CODELINE_SIZE);
}

extern unsigned char audiobuff[];
void cleanAudioBuff() { memset(audiobuff, 0x00, AUDIO_BUFF_SIZE); } 

extern unsigned char picturebuff[];
void cleanPictureBuff() { memset(picturebuff, 0x00, PICTURE_BUFF_SIZE); } 

extern int curToken;

// ============ Tmp Compatibility Code ===============
extern bool isWriting;

void lcd_println(char* text) { isWriting = true; Serial.print("LCD:"); Serial.println(text); isWriting = false; }

bool checkbreak() { return false; }

// ============ Tmp Compatibility Code =============== 



#ifdef BOARD_VGA
  #include "dev_screen_VGATEXT.h"
#endif


#ifdef BOARD_RPID
  #include "dev_screen_RPIGFX.h"
#endif

#ifdef BUILTIN_KBD
  #include "dev_kbd.h"
#endif

#ifdef BOARD_SND
  #include "dev_sound_dfplayer.h"
#endif


 // external forward decl.
 char charUpCase(char ch);
 bool endsWith(char* str, char* what);

 void host_outputString(char* str);
 int host_outputInt(long v);
 void host_outputChar(char c);
 void host_showBuffer();

// ===============================

bool STORAGE_OK = false;


#ifdef FS_SUPPORT

 void setupSD() {
   #ifdef BUT_ESP32
     esp32.initFS();
   #endif

   #ifdef USE_SDFAT_LIB
     if (!sd.begin()) {
   #elif defined(ESP32_FS)
     if (true) {
   #else
     if (!SD.begin(BUILTIN_SDCARD)) { // Teensy3.6 initialization
   #endif
        led3(true);   delay(500);
        led3(false);  delay(500);
        led3(true);   delay(500);
        led3(false);  delay(500);
       return;
     }
   led1(true);   delay(500);
   led1(false);  delay(500);
 
   #ifdef USE_SDFAT_LIB
     sd.chvol();
   #endif
   STORAGE_OK = true;
 }
#endif // FS_SUPPORT

#ifdef BUT_TEENSY
  void _noInterrupts() {
  //   myTimer.end();
  }

  void _interrupts() {
    // myTimer.begin(_ISR_emul, 150000); // 150ms
    // myTimer.priority( 20 ); // 0 maximum priority
  }
#endif




 // ========= Btns Sub System =======
 bool btn1() {
  return mcu.btn(BTN_1);
 }

 bool btn2() {
  return mcu.btn(BTN_2);
 }

 bool btn3() {
  return mcu.btn(BTN_3);
 }

bool anyBtn() { return btn1() || btn2() || btn3(); }


 // ========= Led Sub System ========

void led1(bool state) { mcu.led(1, state); }
void led2(bool state) { mcu.led(2, state); }
void led3(bool state) { mcu.led(3, state); }

void activityLed(bool state) {
  mcu.led(1, state);
}

 // ======= Sound Sub System =======
 #include "xtase_tone.h"
 typedef struct Note {
  unsigned char note;
  unsigned short duration;
 } Note;

//  enum {
//    AUDIO_FORMAT_T5K = 0,
//    AUDIO_FORMAT_T53,
//  };

extern bool BUZZER_MUTE;


void playNote(int note_freq, int duration) {
  if ( BUZZER_MUTE ) { return; }
  if ( note_freq >= 1 && note_freq <= 48 ) {
    // 0..48 octave2 to 5
    note_freq = notes[ note_freq-1 ];
  } else if ( note_freq >= 49 && note_freq <= 4096 ) {
    // 49..4096 -> 19200/note in Hz
    note_freq *= 20;
  } else {
    note_freq = 0;
  }

  mcu.noTone();
  mcu.tone( note_freq, duration*50 );
  delay(duration*50);
  mcu.noTone(); // MANDATORY for ESP32Oled
}

void playTuneString(char* strTune) {
  mcu.noTone();

  int defDuration = 200;
  int slen = strlen( strTune );
  for (int i=0; i < slen; i++) {
    char ch = strTune[i];
    ch = charUpCase(ch);
    bool sharp = false;
    if ( i+1 < slen && strTune[i+1] == '#' ) { 
      sharp = true; 
      i++; 
    }  

    int pitch = 0;
    switch (ch) {
        case 'C' :
          if ( sharp ) { pitch = notes[ NOTE_CS4 ]; }
          else pitch = notes[ NOTE_C4 ];
        break;
        case 'D' :
          if ( sharp ) { pitch = notes[ NOTE_DS4 ]; }
          else pitch = notes[ NOTE_D4 ];
        break;
        case 'E' :
          pitch = notes[ NOTE_E4 ];
        break;
        case 'F' :
          if ( sharp ) { pitch = notes[ NOTE_FS4 ]; }
          else pitch = notes[ NOTE_F4 ];
        break;
        case 'G' :
          if ( sharp ) { pitch = notes[ NOTE_GS4 ]; }
          else pitch = notes[ NOTE_G4 ];
        break;
        case 'A' :
          if ( sharp ) { pitch = notes[ NOTE_AS4 ]; }
          else pitch = notes[ NOTE_A4 ];
        break;
        case 'B' :
          pitch = notes[ NOTE_B4 ];
        break;
    }

   if (!BUZZER_MUTE) mcu.tone(pitch, defDuration);
   delay(defDuration);

  }
  mcu.noTone(); // MANDATORY for ESP32Oled
} // end of playTuneStreamSTring


// T5K Format
void __playTune(unsigned char* tuneStream, bool btnStop);
// T53
void __playTuneT53(unsigned char* tuneStream, bool btnStop);



//void playTuneFromStorage(const char* tuneStreamName, int format = AUDIO_FORMAT_T5K, bool btnStop = false) {
void playTuneFromStorage(char* tuneStreamName, int format = AUDIO_FORMAT_T5K, bool btnStop = false) {

