fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
  if ( !STORAGE_OK ) {
    host_outputString("ERR : Storage not ready\n");
    return;
  }

  cleanAudioBuff();

  #ifndef FS_SUPPORT
    host_outputString("ERR : NO Storage support\n");
  #else

  // SdFile zik("monkey.t5k", O_READ);

  led3(true);

  int tlen = strlen(tuneStreamName);
  if ( tlen < 1 ) {
    host_outputString("ERR : NO file provided\n");
    led3(false);
    return;
  }

  char lastCh = tuneStreamName[ tlen-1 ];
  if ( lastCh >= 'a' && lastCh <= 'z' ) { lastCh = lastCh - 'a' + 'A'; }
  tuneStreamName[ tlen-1 ] = lastCh;

  #ifdef ESP32_FS
    char ftuneStreamName[8+1+3+1];
    strcpy(ftuneStreamName, "/");
    strcat(ftuneStreamName, tuneStreamName);
  #else
    char ftuneStreamName[8+1+3];
    strcpy(ftuneStreamName, tuneStreamName);
  #endif

  
  

  if ( !(( lastCh == 'K' || lastCh == '3') && (tlen >= 2 && tuneStreamName[ tlen-2 ] == '5') ) ) {
    if ( format == AUDIO_FORMAT_T5K ) {
      strcat(ftuneStreamName, ".T5K");
    } else {
      strcat(ftuneStreamName, ".T53");
    }
  }

  // regular SD lib
  // curFile = SD.open("monkey.t5k", FILE_READ);
  // if (!curFile) {
  //  led1(true);
  //  return;        
  // }

  #ifdef ESP32_FS
    // host_outputString("ZIK NYI for esp32\n");
    // host_showBuffer();
    unsigned char preBuff[2];
    int n = esp32.getFs()->readBinFile(ftuneStreamName, preBuff, 2);
    if ( n <= 0 ) {
      host_outputString( ftuneStreamName );
      host_outputString("\n");
      host_outputString("ZIK File not ready\n");
      host_showBuffer();
      return;
    }

    int nbNotes = (preBuff[0]<<8)|preBuff[1];

    int fileLen = (nbNotes*sizeof(Note))+2+16+2;
    if ( format == AUDIO_FORMAT_T53 ) {
      fileLen = (nbNotes*(3+3+3))+2+16+2;
    }

    //file.read( audiobuff, fileLen );
    n = esp32.getFs()->readBinFile(ftuneStreamName, audiobuff, fileLen);

    led3(false);

    if ( format == AUDIO_FORMAT_T5K ) {
      __playTune( audiobuff, btnStop );  
    } else {
      __playTuneT53( audiobuff, btnStop );  
    }

  #else
    // sdfat lib
    SdFile file;
    if (! file.open( ftuneStreamName , O_READ) ) {
      led1(true);
      return;        
    }

    //  host_outputString( "OK : Opening : " );
    //  host_outputString( (char*)tuneStreamName );
    //  host_outputString( "\n" );
    //zik.rewind();

    int nbNotes = (file.read()<<8)|file.read();
    file.seekSet(0);
    int fileLen = (nbNotes*sizeof(Note))+2+16+2;
    if ( format == AUDIO_FORMAT_T53 ) {
      fileLen = (nbNotes*(3+3+3))+2+16+2;
    }
    //file.readBytes( audiobuff, fileLen );
    file.read( audiobuff, fileLen );

    led3(false);
    file.close();

    if ( format == AUDIO_FORMAT_T5K ) {
      __playTune( audiobuff, btnStop );  
    } else {
      __playTuneT53( audiobuff, btnStop );  
    }

    #endif
  #endif
  
  mcu.noTone(); // MANDATORY for ESP32Oled
 }
 
// where tuneStream is the audio buffer content
void __playTune(unsigned char* tuneStream, bool btnStop = false) {
  mcu.noTone();

  short nbNotes = (*tuneStream++ << 8) | (*tuneStream++);
  char songname[16];
  for(int i=0; i < 16; i++) {
    songname[i] = *tuneStream++;
  }
  short tempoPercent = (*tuneStream++ << 8) | (*tuneStream++);

  //printfln("nbN:%d title:'%s' tmp:%d", nbNotes, (const char*)songname, tempoPercent);
  //if ( !true ) {
  #ifdef COMPUTER
    host_outputString("   -= Playing =-\n");
    host_outputString( songname );
    host_outputString("\n");
    host_showBuffer();
  #endif
  //}

  // #if ((defined SCREEN_SUPPORT) && (SCREEN_SUPPORT > 0))
  //   //lcd_cls();
  //   //           12345678901234567890
  //   lcd_println("   -= Playing =-\n");
  //   lcd_println("-=%s=-", (const char*)songname);
  // #endif

  float tempo = (float)tempoPercent / 100.0;
  // cf a bit too slow (Cf decoding)
  tempo *= 0.97;

  for (int thisNote = 0; thisNote < nbNotes; thisNote++) {
    int note = *tuneStream++;
    short duration = (*tuneStream++ << 8) | (*tuneStream++);
    // note 0 -> silence
    if ( note > 0 ) {
      if (!BUZZER_MUTE) mcu.tone(notes[ note-1 ], duration);

      // just a try
      led2( note > 30 );
      led3( note > 36 );
      // just a try


    }
    // to distinguish the notes, set a minimum time between them.
    // the note's duration + 10% seems to work well => 1.10:
    int pauseBetweenNotes = duration * tempo;
    delay(pauseBetweenNotes);
    // stop the tone playing:
    mcu.noTone();

    if (btnStop && anyBtn() ) {
      led2(false);
      led3(false);
      return;
    }

    if ( checkbreak() ) { 
      #if ((defined SCREEN_SUPPORT) && (SCREEN_SUPPORT > 0))
        lcd_println("STOP"); 
      #endif
      led2(false);
      led3(false);
      return; 
    }
  }
   led2(false);
   led3(false);
 }

 // T53 Format
 // where tuneStream is the audio buffer content
void __playTuneT53(unsigned char* tuneStream, bool btnStop = false) {
  mcu.noTone();
  
  short nbNotes = (*tuneStream++ << 8) | (*tuneStream++);
  char songname[16];
  for(int i=0; i < 16; i++) {
    songname[i] = *tuneStream++;
  }
  short tempoPercent = (*tuneStream++ << 8) | (*tuneStream++);

  //printfln("nbN:%d title:'%s' tmp:%d", nbNotes, (const char*)songname, tempoPercent);
  if ( !true ) {
    host_outputString("   -= Playing =-");
    host_outputString( songname );
    host_outputString("\n");
    host_showBuffer();
  }
  
  // #if ((defined SCREEN_SUPPORT) && (SCREEN_SUPPORT > 0))
  //   //lcd_cls();
  //   //           12345678901234567890
  //   lcd_println("   -= Playing =-");
  //   lcd_println("-=%s=-", (const char*)songname);
  // #endif

  float tempo = (float)tempoPercent / 100.0;
  // cf a bit too slow (Cf decoding)
  tempo *= 0.97;

  for (int thisNote = 0; thisNote < nbNotes; thisNote++) {
    short note = (*tuneStream++ << 8) | (*tuneStream++);
    short duration = (*tuneStream++ << 8) | (*tuneStream++);
    short wait = (*tuneStream++ << 8) | (*tuneStream++);
    
    // note 0 -> silence
    if ( note > 0 ) {
      if (!BUZZER_MUTE) mcu.tone(note, duration);
    }

    delay(wait*tempo);
    // stop the tone playing:
    mcu.noTone();

