fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
    if (btnStop && anyBtn() ) {
      return;
    }

    if ( checkbreak() ) { 
      #if ((defined SCREEN_SUPPORT) && (SCREEN_SUPPORT > 0))
        lcd_println("STOP"); 
      #endif
      return; 
    }
  }
   
 }

// ==============================================
// =
// = Graphical Ops.
// =
// ==============================================
//#define WHITE 1
//#define BLACK 0

#define RPID_BLACK -16777216
#define RPID_WHITE -1
#define RPID_RED   -65536
#define RPID_GREEN -16711936
#define RPID_BLUE  -16776961

// manually triggered
void draw_blitt() {
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {

    mcu.getScreen()->blitt( SCREEN_BLITT_AUTO ); // TODO : CHECK THAT

  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    #ifdef BOARD_RPID
    #endif
  }  
}

void drawLine(int x1, int y1, int x2, int y2) {
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
    mcu.getScreen()->drawLine(x1, y1, x2, y2, WHITE);
  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    #ifdef BOARD_RPID
      rpid_gfx_line(x1, y1, x2, y2, RPID_WHITE);
    #endif
  }
}

void drawCircle(int x1, int y1, int radius) {
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
    mcu.getScreen()->drawCircle(x1, y1, radius, WHITE);
  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    #ifdef BOARD_RPID
      rpid_gfx_circle(x1, y1, radius, RPID_WHITE);
    #endif
  }
}

// 0: black else :white
void drawPixel(int x1, int y1, int color) {
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
      mcu.getScreen()->drawPixel(x1, y1, color == 1 ? WHITE : BLACK);
  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    #ifdef BOARD_RPID
      rpid_gfx_drawPixel(x1, y1, RPID_WHITE);
    #endif
  }
}

// color : 0 black / 1 white / 2 ~gray
// mode  : 0 draw / 1 fill
void drawRect(int x, int y, int w, int h, int color, int mode) {
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
      mcu.getScreen()->drawRect(x, y, w, h, color, mode);
  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    #ifdef BOARD_RPID
      // no gray support @ this time
      // no fill support @ this time
      unsigned int c = color == 0 ? RPID_BLACK : RPID_WHITE;
      rpid_gfx_line(x, y, x+w, y, c);
      rpid_gfx_line(x+w, y, x+w, y+h, c);
      rpid_gfx_line(x+w, y+h, x, y+h, c);
      rpid_gfx_line(x, y+h, x, y, c);
    #endif
  }
}

bool drawBPPfile(char* filename) {

  #ifndef FS_SUPPORT
    host_outputString("ERR : storage not supported\n");
    return false;
  #endif

  if ( ! STORAGE_OK ) {
    host_outputString("ERR : storage not ready\n");
    return false;
  }

  if ( filename == NULL || strlen(filename) <= 0 ) { 
    host_outputString("ERR : invalid file\n");
    return false;
  }

  autocomplete_fileExt(filename, ".BPP");
  
  // do something w/ these bytes ...
  if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
        mcu.getScreen()->drawPictureBPP(SDentryName, 0, 0);
  } else if (GFX_DEVICE == GFX_DEV_RPID_SERIAL) {
    // #ifdef BUILTIN_LCD
    //   // TMP !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    //   #ifdef BUT_ESP32
    //     esp32.getScreen()->clear();
    //     esp32.getScreen()->drawImg(0, 0, 128, 64, picturebuff);
    //     if ( isGfxAutoBlitt() ) esp32.getScreen()->blitt();
    //   #else
    //     display.clearDisplay();
    //     display.drawBitmap(0, 0, picturebuff, 128, 64, 0x01);
    //     if ( isGfxAutoBlitt() ) display.display();
    //   #endif
    // #endif
  }

  return true;
}

bool drawPCTfile(char* filename, int x, int y) {

  #ifndef FS_SUPPORT
    host_outputString("ERR : storage not supported\n");
    return false;
  #endif

  if ( ! STORAGE_OK ) {
    host_outputString("ERR : storage not ready\n");
    return false;
  }

  if ( filename == NULL || strlen(filename) <= 0 ) { 
    host_outputString("ERR : invalid file\n");
    return false;
  }

  autocomplete_fileExt(filename, ".PCT");


#if defined(ESP32PCKv2) and defined(COLOR_64K) 
  esp32.lockISR();
        // int n = esp32.getFs()->readBinFile(SDentryName, color_picturebuff, COLOR_PICTURE_BUFF_SIZE);
        esp32.getScreen()->drawPctFile(x, y, SDentryName);
        if ( isGfxAutoBlitt() ) esp32.getScreen()->blitt();
  esp32.unlockISR();
#else
  host_outputString("ERR : can't draw that\n");
#endif


  // #if defined(FS_SUPPORT)  and defined( COLOR_64K )
  //   #if defined(ESP32_FS)
  //     esp32.lockISR();
  //     int n = esp32.getFs()->readBinFile(SDentryName, color_picturebuff, COLOR_PICTURE_BUFF_SIZE);
  //     esp32.unlockISR();
  //     if ( n <= 0 ) { 
  //       host_outputString("ERR : File not ready\n");
  //       return false;
  //     } /* else if (n != COLOR_PICTURE_BUFF_SIZE) {
  //       host_outputString("ERR : File not valid\n");
  //       host_outputInt( n );
  //       host_outputString(" bytes read\n");
  //       return false;
  //     } */
  //   #endif
  // #endif


  // // do something w/ these bytes ...
  // if ( GFX_DEVICE == GFX_DEV_LCD_MINI ) {
  //   #if defined(BUILTIN_LCD) and defined( COLOR_64K )
  //     #ifdef BUT_ESP32
  //       esp32.lockISR();
  //       //esp32.getScreen()->clear();
  //       esp32.getScreen()->drawPct(x, y, color_picturebuff);
  //       if ( isGfxAutoBlitt() ) esp32.getScreen()->blitt();
  //       esp32.unlockISR();
  //     #else
  //       host_outputString("no ESP32\n");
  //       return false;
  //     #endif
  //   #else
  //     host_outputString("no LCD\n");
  //     return false;
  //   #endif
  // }

return true;
}


// ==============================================
// =
// = FileSystem Ops.
// =
// ==============================================

 #ifndef FS_SUPPORT
  void lsStorage(char* filter=NULL, bool sendToArray=false) {
    host_outputString("ERR : NO Storage support\n");
  }
 #else
  extern int curY;

  #ifdef ESP32_FS

    void esp_ls_callback(char* entry,uint32_t size) {
      host_outputString(entry);
      host_outputString(" (");
      host_outputInt(size);
      host_outputString(")\n");
      host_showBuffer();
    }

    void lsStorage(char* filter=NULL, bool sendToArray=false) {
      if ( sendToArray ) {
        host_outputString("DIR2ARRAY NYI !");
        host_showBuffer();
        return;
      }

      esp32.lockISR();
      int cpt = esp32.getFs()->listDir("/", esp_ls_callback);
      esp32.unlockISR();

      host_outputString("nb files : ");
      host_outputInt( cpt );
      host_outputString("\n");
      host_showBuffer();
    }


  #else

