fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
    bool _lsStorage(SdFile dirFile, int numTabs, bool recurse, char* filter, bool sendToArray);

    // filter can be "*.BAS"
    // sendToArray == true -> create "DIR$" array & fill it
    //   instead of sending to console display
    void lsStorage(char* filter=NULL, bool sendToArray=false) {
      bool recurse = false;

      // SdFile dirFile;

      if ( !STORAGE_OK ) {
        host_outputString("ERR : Storage not ready\n");
        return;
      }

      if (!dirFile.open("/", O_READ)) {
        host_outputString("ERR : opening SD root failed\n");
        return;
      }

  //root = SD.open("/");

      _lsStorage(dirFile, 0, recurse, filter, sendToArray);
      //_lsStorage2(root, 0, recurse, filter);

  // root.close();

      dirFile.close();
    }


  //  #ifndef SCREEN_HEIGHT
  //   #define SCREEN_HEIGHT       8
  //  #endif

  bool _lsStorage(SdFile dirFile, int numTabs, bool recurse, char* filter, bool sendToArray) {
      SdFile file;

      if ( sendToArray ) {
        // can't use createArray because it use expr stack
        #define MAX_FILE_IN_ARRAY 128
        if ( ! xts_createArray("DIR$", 1, MAX_FILE_IN_ARRAY) ) {
          host_outputString("Could not create DIR$\n");
          return false;
        }
      }

      int cpt = 0;
      while (file.openNext(&dirFile, O_READ)) {
        if (!file.isSubDir() && !file.isHidden() ) {
          // //file.printFileSize(&Serial);
          // //file.printModifyDateTime(&Serial);
          // //file.printName(&Serial);

          memset(SDentryName, 0x00, 13);
          file.getName( SDentryName, 13 );

          if ( filter != NULL ) {
            // TODO : optimize !!!!!
            int strt = 0;
            if ( filter[strt] == '*' ) { strt++; }
            if ( filter[strt] == '.' ) { strt++; } // see 'else' case

            int tlen = strlen(SDentryName);
            int flen = strlen(filter);
            if ( tlen > 4 ) {
              if ( SDentryName[ tlen-1-3 ] == '.' ) {
                bool valid = true;
                for(int i=0; i < flen-strt; i++) {

                  //host_outputChar( SDentryName[ tlen-3+i ] ); host_outputChar(' ');host_outputChar(filter[strt+i]);host_outputChar('\n');

                  if ( charUpCase( SDentryName[ tlen-3+i ] ) != charUpCase(filter[strt+i]) ) {
                    valid = false;
                    break;
                  }
                }
                if ( !valid ) { file.close(); continue; }
              } else {
                file.close(); 
                continue;
              }
            } else {
              file.close(); 
              continue;
            }
          }

          if ( !sendToArray ) {
            host_outputInt( (cpt+1) );
            host_outputString("\t");
            host_outputString(SDentryName);
          } else {
            // SDentryName @ (cpt+1)

            // to check
            if ( file.isDir() ) { SDentryName[ 13-1 ] = '/'; }
            else                { SDentryName[ 13-1 ] = 0x00; }

            if ( xts_setStrArrayElem( "DIR$", (cpt+1), SDentryName ) != ERROR_NONE ) {
              host_outputInt( (cpt+1) );
              host_outputString("\t");
              host_outputString(SDentryName);
              host_outputString(" : ERROR\n");

              break;
            }
          }

          if ( file.isDir() ) {
            // Indicate a directory.
            if ( !sendToArray ) {
              host_outputString("/");
            }
          }
          if ( !sendToArray ) {
            host_outputString("\n");

            // TMP - DIRTY ----- begin
            if ( cpt % SCREEN_HEIGHT == SCREEN_HEIGHT-1 ) {
              host_showBuffer();
            }
            // TMP - DIRTY ----- end
          }

          cpt++;

        }
        file.close();
      }

      if ( sendToArray ) {
        xts_setStrArrayElem( "DIR$", (cpt+1), "-EOF-" );
      } else {
        host_outputString("nb files : ");
        host_outputInt( cpt );
        host_outputString("\n");
        host_showBuffer();
      }

      return true;
    }

  #endif // not ESP32-FS

 #endif // FS_SUPPORT


 // ==== Load/Save source code (ascii) from SDCard ====

 #ifndef FS_SUPPORT
  void loadAsciiBas(char* filename) {
    host_outputString("ERR : NO Storage support\n");
    host_showBuffer();
  }

  void saveAsciiBas(char* filename) {
    host_outputString("ERR : NO Storage support\n");
    host_showBuffer();
  }

  void llistAsciiBas(char* filename) {
    if ( filename == NULL ) {
      // TODO
      host_outputString("TODO: dump PRGM to Serial\n");
      host_showBuffer();
      return;
    }
    host_outputString("ERR : NO Storage support\n");
    host_showBuffer();
  }


 #else

  #ifdef ESP32_FS
    void loadCallback(char* codeLine) {

      if ( codeLine == NULL ) { Serial.println("CANT HANDLE NULL LINES"); return; }

      //Serial.print(">> ");Serial.println(codeLine);

      // interpret line
      int ret = tokenize((unsigned char*)codeLine, tokenBuf, TOKEN_BUF_SIZE); 
      if (ret == 0) { ret = processInput(tokenBuf); }
      if ( ret > 0 ) { 
        //host_outputInt( curToken );
        host_outputString((char *)codeLine);
        host_outputString((char *)" ->");
        host_outputString((char *)errorTable[ret]); 
        host_outputString((char *)" @");
        //host_outputInt( lineCpt );
        host_outputInt( 999 );
        host_outputString((char *)"\n");
        host_showBuffer(); 
      }
    }
  #endif


 void loadAsciiBas(char* filename) {
  if ( !STORAGE_OK ) {
    host_outputString("ERR : Storage not ready\n");
    host_showBuffer();
    return;
  }

  autocomplete_fileExt(filename, BASIC_ASCII_FILE_EXT);

  #ifdef ESP32_FS

    cleanCodeLine();
    memset( tokenBuf, 0x00, TOKEN_BUF_SIZE );

    esp32.lockISR();
    //esp32.getFs()->readTextFile(SDentryName, loadCallback);
    bool ok = esp32.getFs()->openCurrentTextFile( SDentryName );
    if ( !ok ) {
      Serial.println( "-FAILED-" );
      host_outputString( "-FAILED-\n" );
      host_showBuffer();
    } else {
      char* codeLine; int cpt = 0;
      while( (codeLine = esp32.getFs()->readCurrentTextLine() ) != NULL ) {
        //if ( strlen(codeLine) == 0 ) { break; }
Serial.println( codeLine );
        loadCallback( codeLine );
        //Serial.println( codeLine );
      }
      esp32.getFs()->closeCurrentTextFile();
    }
    esp32.unlockISR();

