fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
    host_outputString( "-EOF-\n" );
    host_showBuffer();

    return;
  #else
    // SFATLIB mode -> have to switch for regular SD lib
    SdFile file;
    if (! file.open( SDentryName , O_READ) ) {
      led1(true);
      host_outputString("ERR : File not ready\n");
      host_showBuffer();
      return;        
    }

    file.seekSet(0);

    int n;

    //reset(); // aka NEW -- no more Cf saveLoadCmd() call

    cleanCodeLine();
    memset( tokenBuf, 0x00, TOKEN_BUF_SIZE );
    int lineCpt = 1;
    while( ( n = file.fgets(codeLine, ASCII_CODELINE_SIZE) ) > 0 ) {
      // // show line
      // host_outputString( codeLine );
      // if ( codeLine[n-1] != '\n' ) {
      //   host_outputString( "\n" );
      // }
      // host_showBuffer();

      // interpret line
      int ret = tokenize((unsigned char*)codeLine, tokenBuf, TOKEN_BUF_SIZE); 
      if (ret == 0) { ret = processInput(tokenBuf); }
      if ( ret > 0 ) { 
        //host_outputInt( curToken );
        host_outputString((char *)codeLine);
        host_outputString((char *)" ->");
        host_outputString((char *)errorTable[ret]); 
        host_outputString((char *)" @");
        host_outputInt( lineCpt );
        host_outputString((char *)"\n");
        host_showBuffer(); 
      }
      //ret = ERROR_NONE;
      cleanCodeLine();
      memset( tokenBuf, 0x00, TOKEN_BUF_SIZE );
      lineCpt++;
    }
    file.close();

    host_outputString( "-EOF-\n" );
    host_showBuffer();
  #endif
}


void _serializeTokens(unsigned char *p, char* destLine) {
  int modeREM = 0;
  while (*p != TOKEN_EOL) {
      if (*p == TOKEN_IDENT) {
          p++;
          while (*p < 0x80) {
              //host_outputChar(*p++);
              (*destLine++) = (*p++);
          }
          //host_outputChar((*p++)-0x80);
          (*destLine++) = ((*p++)-0x80);
      }
      else if (*p == TOKEN_NUMBER) {
          p++;
          static char tmp[15];
          //host_outputFloat(*(float*)p);
          sprintf( tmp, "%f", *(float*)p ); 
          strcat( destLine, tmp );
          destLine+=strlen(tmp); // BEWARE !!!!+ optim 
          p+=4;
      }
      else if (*p == TOKEN_INTEGER) {
          p++;
          // host_outputInt(*(long*)p);
          static char tmp[15];
          sprintf( tmp, "%d", (int)( *(long*)p ) ); 
          strcat( destLine, tmp );
          destLine+=strlen(tmp); // BEWARE !!!!+ optim 
          p+=4;
      }
      else if (*p == TOKEN_STRING) {
          p++;
          if (modeREM) {
              //host_outputString((char*)p);
              (*destLine) = (*p);
              p+=1 + strlen((char*)p);
              destLine+=1 + strlen((char*)p);//BEWARE!!!!+ optim 
          }
          else {
              //host_outputChar('\"');
              (*destLine++) = ('\"');
              while (*p) {
                  if (*p == '\"') {
                    //host_outputChar('\"');
                    (*destLine++) = ('\"');
                  }
                  //host_outputChar(*p++);
                  (*destLine++) = (*p++);
              }
              // host_outputChar('\"');
              (*destLine++) = ('\"');
              p++;
          }
      }
      else {
          //uint8_t fmt = pgm_read_byte_near(&tokenTable[*p].format);
          uint8_t fmt = tokenTable[*p].format;

          if (fmt & TKN_FMT_PRE) {
              //host_outputChar(' ');
              (*destLine++) = (' ');
          }

          //host_outputString((char *)pgm_read_word(&tokenTable[*p].token));
          //host_outputString((char *)tokenTable[*p].token);
          strcat(destLine, (char *)tokenTable[*p].token );
          destLine += strlen( (char *)tokenTable[*p].token ); // BEWARE + optim !!!

          if (fmt & TKN_FMT_POST) {
              //host_outputChar(' ');
              (*destLine++) = (' ');
          }
          if (*p==TOKEN_REM || *p==TOKEN_REM_EM) {
              modeREM = 1;
          }
          p++;
      }
  }
}





void saveAsciiBas(char* filename) {
  if ( !STORAGE_OK ) {
    host_outputString("ERR : Storage not ready\n");
    host_showBuffer();
    return;
  }

  autocomplete_fileExt(filename, BASIC_ASCII_FILE_EXT);

  #ifdef ESP32_FS

    esp32.lockISR();

    Serial.println("clean");
    esp32.getFs()->remove(SDentryName);
    Serial.println("open");
    //esp32.getFs()->openCurrentTextFile(SDentryName, false);
    //esp32.getFs()->writeCurrentTextLine("1 ' blank\n");

    File f = SPIFFS.open(SDentryName, "w");
    if ( !f ) { Serial.println("NOT ACCESSIBLE"); esp32.unlockISR(); return; }
    Serial.println("seek");
    f.seek(0);
    Serial.println("seeked");

    char lineNumStr[7];

    cleanCodeLine();
    unsigned char *p = &mem[0];
    while (p < &mem[sysPROGEND]) {
        uint16_t lineNum = *(uint16_t*)(p+2);
        // file.print(lineNum);
        // file.print(" ");

        sprintf(lineNumStr, "%d ", lineNum);
        f.print(lineNumStr);

        _serializeTokens(p+4, codeLine);
        f.print(codeLine);
        //esp32.getFs()->writeCurrentTextLine(codeLine);
        cleanCodeLine();

        f.print("\r\n");
        //esp32.getFs()->writeCurrentTextLine("\n");
        p+= *(uint16_t *)p;
        f.flush();
        Serial.println("line");
    }
    f.print("\r\n");
    f.flush();
    Serial.println("flushed");
    f.close();
    esp32.unlockISR();

    Serial.println("closed");
    //esp32.getFs()->writeCurrentTextLine("\n");

        
    host_outputString( "-EOF-\n" );
    host_showBuffer();

    //esp32.getFs()->closeCurrentTextFile();

  #else
    // SFATLIB mode -> have to switch for regular SD lib
    sd.remove( SDentryName );
    SdFile file;

    if (! file.open( SDentryName , FILE_WRITE) ) {
      led1(true);
      host_outputString("ERR : File not ready\n");
      host_showBuffer();
      return;        
    }

    file.seekSet(0);

    // file.print("coucou1"); file.print("\n");
    // file.flush();

    cleanCodeLine();
    unsigned char *p = &mem[0];
    while (p < &mem[sysPROGEND]) {
        uint16_t lineNum = *(uint16_t*)(p+2);
            file.print(lineNum);
            file.print(" ");

            //printTokens(p+4);
            _serializeTokens(p+4, codeLine);
            file.print(codeLine);
            cleanCodeLine();

            file.print("\n");
        p+= *(uint16_t *)p;
    }
    file.flush();

    
