fgalliat/BasicAr/subComponents/ESP32_Pocketv3/BasicAr/host_xts.cpp
    host_outputString( "-EOF-\n" );
    host_showBuffer();

    file.close();
  #endif
}

// ====== LLIST ==================
#define outSerial Serial

void llistAsciiBas(char* filename=NULL) {
  if ( filename == NULL ) {
    // just DUMP current PRGM to Serial
    cleanCodeLine();
    unsigned char *p = &mem[0];
    while (p < &mem[sysPROGEND]) {
        uint16_t lineNum = *(uint16_t*)(p+2);
        outSerial.print(lineNum);
        outSerial.print(" ");
  
        _serializeTokens(p+4, codeLine);
        outSerial.print(codeLine);
        cleanCodeLine();
  
        outSerial.print("\n");
        p+= *(uint16_t *)p;
    }
    outSerial.print("-EOF-\n");
    outSerial.flush();
    return;
  }

  // ==== ELSE : DUMP PLAIN ASCII BASIC FILE TO SERIAL ====

  if ( !STORAGE_OK ) {
    host_outputString("ERR : Storage not ready\n");
    host_showBuffer();
    return;
  }

  autocomplete_fileExt(filename, BASIC_ASCII_FILE_EXT);

  #ifdef ESP32_FS
    host_outputString("LLIST NYI for esp32\n");
    host_showBuffer();
  #else
    // SFATLIB mode -> have to switch for regular SD lib
    SdFile file;
    if (! file.open( SDentryName , O_READ) ) {
      led1(true);
      host_outputString("ERR : File not ready\n");
      host_showBuffer();
      return;        
    }

    file.seekSet(0);

    int n;

    cleanCodeLine();
    while( ( n = file.fgets(codeLine, ASCII_CODELINE_SIZE) ) > 0 ) {
      outSerial.print( codeLine );
      if ( codeLine[n-1] != '\n' ) {
        outSerial.print( "\n" );
      }
    }
    outSerial.print( "-EOF-\n" );
    outSerial.flush();

    file.close();
  #endif
}



void deleteBasFile(char* filename) {
  if ( !STORAGE_OK ) {
    host_outputString("ERR : Storage not ready\n");
    host_showBuffer();
    return;
  }

  autocomplete_fileExt(filename, BASIC_ASCII_FILE_EXT);

  #ifdef ESP32_FS
    esp32.getFs()->remove( SDentryName );
  #else
    // SFATLIB mode -> have to switch for regular SD lib
    sd.remove( SDentryName );
  #endif
}


 #endif




int MCU_freeRam() {
  // THIS IMPL : just return the space used by the sketch
  // we have to substract varMem & prgmMmem

#ifdef COMPUTER
  int fr = 16*1024*1024; // 16MB
#else
  //extern int __heap_start, *__brkval; 
  extern int *__brkval; 
  int v; 
  //int fr = (int) &v - (__brkval == 0 ? (int) &__heap_start : (int) __brkval); 
  int fr = (int) &v - ((int) __brkval); 
#endif
   Serial.print("Free ram: ");
   Serial.println(fr);
return fr;
}


void MCU_reset() {
  // _restart_Teensyduino_();
  host_outputString("\nRebooting\n");
  host_showBuffer();
  #ifdef BUT_TEENSY
    #ifdef COMPUTER
      closeComputer();
      exit(0);
    #elif defined (ARDUINO_ARCH_ESP32)
      ESP.restart();
    #else
      SCB_AIRCR = 0x05FA0004; // software reset
    #endif
  #endif
      // void(*resetFunc)(void) = 0;
      // resetFunc();
      // for(;;) {}
}

extern bool systemHalted;

void MCU_halt() {
  host_outputString("\nHalting system\n");
  host_showBuffer();
  #ifdef BUT_TEENSY

    #ifdef BOARD_RPID
      rpid_haltGPU(false);
    #endif

    #ifdef BOARD_SND
      snd_pause();
    #endif

    #ifdef COMPUTER
      closeComputer();
      exit(0);
    #else
      systemHalted = true;
    #endif
    
  #endif
}



extern unsigned char mem[];
extern int sysPROGEND;

// il faudrait que le contenu soit tokenized pour que cela fonctionne
const char* TEST_PRGM = "10 ? \"Coucou\"\r20 GOTO 10\r";
void xts_loadTestProgram() {
  // skip the autorun byte
  // sysPROGEND = strlen(TEST_PRGM);
  // for (int i=0; i<sysPROGEND; i++)
  //     mem[i] = TEST_PRGM[i];
}


// =================================


#ifndef DBUG_NOLN
  void DBUG(int v) { Serial.println(v); }
  void DBUG(float v) { Serial.println(v); }
  void DBUG(char* v) { Serial.println(v); }
  void DBUG(const char* v) { Serial.println(v); }
  void DBUG(const char* v, int v2) { Serial.print(v); Serial.println(v2); }

  void DBUG_NOLN(char* v) { Serial.print(v); }
  void DBUG_NOLN(const char* v) { Serial.print(v); }
  void DBUG_NOLN(const char* v, int v2) { Serial.print(v); Serial.print(v2); }
  void DBUG_NOLN(int v) { Serial.print(v); }
#endif

// ========= Console Ops =====================
/*
void onKeyReceived(struct KeyEvent ke) {
  Serial.println("a key was pressed");
}
*/


// ======== System Configuration =============
extern bool selfRun; // for CHAIN "<...>" cmd
extern int xts_loadBas(char * optFilename);
extern int doRun();

void host_system_menu() {
  reset();
  // == true Cf used w/ parameters => bool result
  if ( xts_loadBas("SYSMENU") == true) {
    selfRun = true;
    #ifdef BUT_ESP32
      doRun();
    #endif
  } else {
    host_outputString("no SYSMENU PRGM");
  }
}

